EduCater/Documents/СписаниеНаМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СписаниеНаМеню</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СырьёОстатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Меню</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Меню</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сырьё</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РецептНаименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Рецепты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РецептИзмерение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Измерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РецептТребуется</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сырьё</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сырьё</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Измерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Блюда</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидБлюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Измерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Рецепт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Рецепты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Измерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Требуется</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EduCater/Documents/Меню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Меню</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаМеню</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Меню</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Измерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EduCater/Catalogs/Рецепты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Рецепты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Блюда</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Измерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EduCater/Documents/СписаниеНаМеню/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура МенюПриИзменении(Элемент)
    // Очистка табличной части "Сырьё" перед заполнением новыми данными
    Объект.Сырьё.Очистить();
    ЗаполнитьБлюда(Объект.Меню);
    ЗаполнитьРецепты(Объект.Меню);
    
    // Заполнение табличной части "Сырьё" данными из табличной части "Рецепты"
    Для каждого стр Из Объект.Рецепт Цикл
        новСтр = Объект.Сырьё.Добавить();
        новСтр.РецептНаименование = стр.Наименование;
        новСтр.РецептИзмерение = стр.Измерение;
        новСтр.РецептТребуется = стр.Требуется;
    КонецЦикла;
КонецПроцедуры        

&НаСервере
Процедура ЗаполнитьБлюда(Ссылка)
    // Очистка табличной части "Блюда" перед заполнением
    Объект.Блюда.Очистить();
    
    // Формирование запроса для получения данных для табличной части "Блюда"
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                    |   МенюМеню.Блюдо КАК Блюдо,
                    |   МенюМеню.Блюдо.Вид КАК Вид,
                    |   МенюМеню.Измерение,
                    |   МенюМеню.Количество
                    |ИЗ
                    |   Документ.Меню.Меню КАК МенюМеню
                    |ГДЕ
                    |   МенюМеню.Ссылка = &Ссылка";
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    
    // Заполнение табличной части "Блюда" данными из результата запроса
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Объект.Блюда.Добавить();
        НоваяСтрока.Блюдо = Выборка.Блюдо;
        НоваяСтрока.Вид = Выборка.Вид;
        НоваяСтрока.Измерение = Выборка.Измерение;
        НоваяСтрока.Количество = Выборка.Количество;
    КонецЦикла;
КонецПроцедуры         

&НаСервере
Процедура ЗаполнитьРецепты(Ссылка)
    // Очистка табличной части "Рецепты" перед заполнением
    Объект.Рецепт.Очистить();
    
    // Формирование запроса для получения данных для табличной части "Рецепты"
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                    |   Меню.Блюдо КАК Блюдо,
                    |   Рецепты.Ссылка КАК Наименование,
                    |   Рецепты.Измерение,
                    |   Рецепты.Количество,
                    |   Рецепты.Количество * Меню.Количество КАК Требуется
                    |ИЗ
                    |   (ВЫБРАТЬ
                    |       МенюМеню.Ссылка КАК Ссылка,
                    |       МенюМеню.Блюдо КАК Блюдо,
                    |       МенюМеню.Измерение КАК Измерение,
                    |       МенюМеню.Количество КАК Количество
                    |   ИЗ
                    |       Документ.Меню.Меню КАК МенюМеню
                    |   ГДЕ
                    |       МенюМеню.Ссылка = &Ссылка) КАК Меню
                    |   ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Рецепты КАК Рецепты
                    |   ПО Меню.Блюдо = Рецепты.Владелец";
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    
    // Заполнение табличной части "Рецепты" данными из результата запроса
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Объект.Рецепт.Добавить();
        НоваяСтрока.Блюдо = Выборка.Блюдо;
        НоваяСтрока.Наименование = Выборка.Наименование;
        НоваяСтрока.Измерение = Выборка.Измерение;
        НоваяСтрока.Количество = Выборка.Количество;
        НоваяСтрока.Требуется = Выборка.Требуется;
    КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Объект.Дата = ТекущаяДата();
КонецПроцедуры
